/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: ปวดหัวตอนเขียนโครงสร้างครั้งเดียว สามารถนำมาใช้ได้หลากหลาย ลดการเขียนโค้ดซ้ำๆ แถมยืดหยุ่นและปรับเปลี่ยนง่าย


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: ง่ายขึ้นเพราะไม่รกเหมือนเคย manaul เดี่ยวๆ อ่านโค้ดของตัวเองแล้วเข้าใจว่า เขียนอะไรลงไป เวลาผ่านไป ถ้าต้องย้อนกลับมาแก้ทีหลังก็เข้าใจได้ง่ายๆ


3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  ถ้าให้อธิบายหลัก concept ให้เห็นภาพง่ายๆก็ ให้เราจินตนาการถึง เครื่องปั่นน้ำผลไม้ ถ้าเราไม่ได้ใช้ฟังก์ชั่น เราก็อาจจะต้องซื้อเครื่องปั่นน้ำส้ม เครื่องปั้นน้ำแตงโม ตามแต่ละชนิดผลไม้
แต่ถ้าเราเปลี่ยนมาเป็นสร้างเครื่องปั่นน้ำผลไม้ โอเค เครื่องใหญ่กว่า การขึ้นโครงสร้างเครื่องปั่น ดูยุ่งยากกว่า แต่ถ้าทำได้แล้ว ก็จะรองรับทุกผลไม้ไปได้เลยยาวๆ ไม่จำเป็นต้องสร้างหลายเครื่องบ่อยๆ
แน่นอนว่า พูดไปอาจจะยังไม่เห็นภาพชัดเท่าไหร่ จนได้ลองใช้กับงานจริงๆ ตอนนี้ให้นายเข้าใจว่าประมาณนี้ก่อน


*/
